export const navLinks = [
  { title: "Стажировки", href: "#" },
  { title: "Ивенты", href: "#" },
  { title: "Образовательные проекты", href: "#" },
  { title: "Олимпиады", href: "#" },
  { title: "Амбассадоры", href: "#" },
  { title: "CodeRun", href: "#" },
];

export const Samples = [
  "Развивают Нейро",
  "Создают геймификацию на трекинге заказа в Яндекс Лавке",
  "Улучшают интерфейсы в Маркете",
  "Совершенствуют интерфейс кабинета подписчика Яндекс Плюса",
  "Создают лендинги, проводят редизайн и добавляют новые функции в Кинопоиске",
  "Разрабатывают продуктовые эксперименты для главной страницы в Яндекс Go",
];

export const Expectations = [
  {
    title: "Оплачиваемая стажировка",
    iconPath: "./icons/expectations/ex-1.svg",
  },
  {
    title: "Доступ к корпоративным фичам",
    iconPath: "./icons/expectations/ex-2.svg",
  },
  {
    title: "Компенсация обедов",
    iconPath: "./icons/expectations/ex-3.svg",
  },
  {
    title: "Оплата проезда и проживания в Москве",
    iconPath: "./icons/expectations/ex-4.svg",
  },
  {
    title: "Официальное оформление на стажировку или практику от вуза",
    iconPath: "./icons/expectations/ex-5.svg",
  },
  {
    title: "Гибкий и гибридный график:20, 30 или 40 часов в неделю",
    iconPath: "./icons/expectations/ex-6.svg",
  },
];

export const Requirements = [
  "Уверенно знать HTML, CSS и основы JavaScript: типы данных, примитивы, функции, прототипы и наследование, замыкания, область и контекст вызова, промисы, асинхронность",
  "Владеть знаниями о базовых алгоритмах и структурах данных",
  "Будет большим преимуществом, если у вас есть опыт промышленной разработки, пет-проекты, вы знаете TypeScript и React, а также знакомы с системами контроля версий, такими как SVN или Git",
];

export const Selection = [
  {
    title: "Тестовое задание в системе Яндекс Контест",
    paragraphs: [
      "Вам предстоит решить 5 задач за 6 часов. Перед тем как начать, рекомендуем пройти тренировочный контест — в нём собраны тестовые задания прошлых лет.",
    ],
  },

  {
    title: "Секция на код",
    paragraphs: [
      "Это техническое собеседование, которое продлится около часа. Вас попросят выполнить от 3 до 6 задач по JavaScript, написав код в онлайн-редакторе.",
      "Чтобы успешно пройти интервью, вам нужно знать основы JavaScript: типы данных, примитивы, функции, асинхронность, прототипы и наследование, замыкания, область и контекст вызова.",
      "Большим плюсом будет понимание промисов. Не пугайтесь, если вам зададут теоретические вопросы по вёрстке.",
    ],
  },
  {
    title: "Тестовое задание в системе Яндекс Контест",
    paragraphs: [
      "Собеседующий попросит вас решить от 2 до 4 задач оптимальным способом в онлайн-редакторе. Потребуется владение основами базовых алгоритмов и понимание их сложности, а также знаниями о структурах данных. Мы оценим ваше умение алгоритмически мыслить, читать свой код и находить в нём ошибки.",
    ],
  },
  {
    title: "Тестовое задание в системе Яндекс Контест",
    paragraphs: [
      "Это встречи-знакомства с вашими будущими коллегами. Они по очереди расскажут, как устроена работа в Яндексе, чем они занимаются и какую роль предполагается отвести вам, а вы сможете задать все интересующие вопросы.",
      "Будьте готовы рассказать о себе, вашем опыте и навыках и ответить на теоретические вопросы.",
    ],
  },
];

export const Advices = [
  {
    imgSrc: "./images/advices/profile-1.png",
    title: "Дмитрий Минаев",
    subtitle: "Руководитель группы в Вертикалях",
    paragraphs: [
      "На старте важно, чтобы стажёр имел техническую базу и понимал основные принципы программирования. Я рекомендую изучить учебник по JavaScript на learn.javascript.ru",
      "Наличие pet-проектов выделяет стажёра на фоне других. Бонусом будет, если работаете в проектах с популярными инструментами, упомянутыми в наших вакансиях.",
      "Сильного стажёра отличает мотивация и цель. Круто, когда у кандидата «огонь в глазах» и понимание, что он ожидает от стажировки.",
    ],
  },

  {
    imgSrc: "./images/advices/profile-2.png",
    title: "Никита Чураков",
    subtitle: "Руководитель службы разработки",
    paragraphs: [
      "Всегда, когда провожу секции, смотрю не на конечный результат, а на ход размышлений. Можно выучить все типы задач, прийти, решить все заготовленные интервьюером задачи за 10 минут и молчать, но это не совсем то, что хочется видеть! Живой ум, поток мыслей, желание рассказать и обсудить своё решение — это то, что хочется видеть в первую очередь. Конечно, есть фактор волнения, который заставляет вас быстрее «закончить» всё это. Но и с ним можно бороться — просто решайте больше, не сдавайтесь даже после неудачных попыток, и тогда удача будет на вашей стороне.",
    ],
  },

  {
    imgSrc: "./images/advices/profile-3.png",
    title: "Даниил Горохов ",
    subtitle: "Разработчик интерфейсов",
    paragraphs: [
      "Для прохождения стажировки нужно иметь хорошую алгоритмическую подготовку. Посещайте Тренировки по алгоритмам и решайте задачи на платформах CodeRun и LeetCode. Сможете эффективно решать сложные задачи и писать быстрый код, а значит, создавать качественные сервисы.",
      "Также важно набить руку на реальных задачах — в процессе могут возникать неожиданные проблемы, и чем раньше с ними столкнуться, тем легче будет в работе. Чтобы набраться опыта, можно попробовать повторить реальный сервис: мессенджер, календарь или графический редактор.",
    ],
  },

  {
    imgSrc: "./images/advices/profile-4.png",
    title: "Николай Митрофанов ",
    subtitle: "Руководитель группы разработки ",
    paragraphs: [
      "На стажировке вам предстоит работать над реальными задачами, которые отличаются от синтетических лабораторных работ или домашних заданий. Чтобы понять, насколько ваши знания соответствуют потребностям современного рынка, возьмите заказ на фрилансе или сделайте сайт для знакомых. Выполнение работы, предполагающей материальное вознаграждение, позволит честно оценить свой уровень знаний, научит вести диалог с заказчиками, прокачает тайм-менеджмент.",
      "Не бойтесь расширять кругозор, прокачивайте системное мышление. В конечном счёте знание языка программирования и алгоритмов без грамотного их применения не принесёт пользу бизнесу.",
    ],
  },

  {
    imgSrc: "./images/advices/profile-5.png",
    title: "Соня Волынская ",
    subtitle: "Руководитель группы разработки интерфейсов WMS в Яндекс Лавке ",
    paragraphs: [
      "На секциях с кодом важно внимательно прочитать и понять условие задачи. Когда вы убедились, что задача понятна, не бегите писать код. Спланируйте решение в голове и расскажите о нём интервьюеру, а ещё лучше — всё время держите его в курсе своих рассуждений, пока придумываете алгоритм. Если решение выглядит разумным — пишите код.",
      "Финал — это знакомство с командой или тимлидом. Здесь может ждать всё, от технических вопросов до беседы про аниме-фигурки. Если добрались сюда, помните — вы уже достойны места в Яндексе!",
    ],
  },
];

export const Testimonials = [
  {
    imgSrc: "./images/testimonials/testimonial-1.png",
    title: "Иван Фомин",
    subtitle: "Стажёр-разработчик интерфейсов в Доставке",
    paragraph: "Лучший способ понять, как работают бизнес-процессы в крупной компании",
  },
  {
    imgSrc: "./images/testimonials/testimonial-2.png",
    title: "Роман Данцер",
    subtitle: "Стажёр-разработчик интерфейсов в Вертикалях",
    paragraph: "Попасть на стажировку проще, чем кажется",
  },
  {
    imgSrc: "./images/testimonials/testimonial-3.png",
    title: "Геннадий Кирилин",
    subtitle: "Стажёр-разработчик интерфейсов в Поиске и Супераппе",
    paragraph: "Решаешь реальные задачи и чувствуешь, как растёшь",
  },
];

export const MaterialsTabs = [
  [
    { title: "CoreRun", href: "https://coderun.yandex.ru/promo" },
    { title: "LeetCode", href: "https://leetcode.com/" },
    { title: "Блог Хелскета", href: "https://ru.hexlet.io/blog" },
    { title: "freeCodeCamp", href: "https://www.freecodecamp.org/news/" },
    { title: "Сщветы Половнёва и Петрова", href: "https://bureau.ru/soviet/polovnyov-petrov/" },
    { title: "Sidebar", href: "https://sidebar.io/break/" },
    { title: "MDN", href: "https://developer.mozilla.org/ru/docs/Learn" },
    {
      title: "Лекции Школы разработки интерфейсов",
      href: "https://www.youtube.com/c/%D0%A4%D1%80%D0%BE%D0%BD%D1%82%D0%B5%D0%BD%D0%B4/videos",
    },
    {
      title: "Наш канал фронтенд-разработки",
      href: "https://www.youtube.com/c/%D0%A4%D1%80%D0%BE%D0%BD%D1%82%D0%B5%D0%BD%D0%B4/videos",
    },
    {
      title: "Повторное введение в JavaScript",
      href: "https://developer.mozilla.org/ru/docs/Web/JavaScript/Language_overview",
    },
    { title: "Современный учебник JavaScript", href: "https://learn.javascript.ru/" },
    { title: "Введение в React", href: "https://ru.react.js.org/tutorial/tutorial.html" },
    { title: "Библиотека React", href: "https://react.dev/" },
    { title: "BigFrontEnd.dev", href: "https://bigfrontend.dev/" },
    { title: "Дока", href: "https://doka.guide/" },
  ],
  [
    { title: "Алгоритмы и структуры данных", href: "https://coderun.yandex.ru/promo" },
    { title: "Структуры данных", href: "https://coderun.yandex.ru/promo" },
    { title: "Тренировки по алгоритмам", href: "https://coderun.yandex.ru/promo" },
    { title: "Алгоритмические собеседования в Яндекс", href: "https://coderun.yandex.ru/promo" },
  ],
];